#pragma once
#include <cstdio>
#include <cstring>
#include "MenuButton.h"
#pragma warning( disable : 4996 )
class Display {
public:
	Display() {}
	~Display() {}

	void mainDisplay() {
		printf("		 __       __                    __            __                        __           \n");
		printf("		/  \\     /  |                  /  |          /  |                      /  |          \n");
		printf("		$$  \\   /$$ | __    __         $$/  _______  $$ |____    ______    ____$$ | __    __ \n");
		printf("		$$$  \\ /$$$ |/  |  /  |        /  |/       \\ $$      \\  /      \\  /    $$ |/  |  /  |\n");
		printf("		$$$$  /$$$$ |$$ |  $$ |        $$ |$$$$$$$  |$$$$$$$  |/$$$$$$  |/$$$$$$$ |$$ |  $$ |\n");
		printf("		$$ $$ $$/$$ |$$ |  $$ |        $$ |$$ |  $$ |$$ |  $$ |$$ |  $$ |$$ |  $$ |$$ |  $$ |\n");
		printf("		$$ |$$$/ $$ |$$ \\__$$ |        $$ |$$ |  $$ |$$ |__$$ |$$ \\__$$ |$$ \\__$$ |$$ \\__$$ |\n");
		printf("		$$ | $/  $$ |$$    $$ | ______ $$ |$$ |  $$ |$$    $$/ $$    $$/ $$    $$ |$$    $$ |\n");
		printf("		$$/      $$/  $$$$$$$ |/      |$$/ $$/   $$/ $$$$$$$/   $$$$$$/   $$$$$$$/  $$$$$$$ |\n");
		printf("		             /  \\__$$ |$$$$$$/                                             /  \\__$$|\n");
		printf("		             $$    $$/                                                     $$    $$/ \n");
		printf("		              $$$$$$/                                                       $$$$$$/  \n\n\n");

		printf("		*************************************************************************************\n");
		printf("			My_inbody는 inbody 측정 데이터를 기반으로 내 몸의 변화를 한 눈에 \n");
		printf("			확인 할 수 있는 프로그램입니다.  Ver.1.0 (Beta) \n\n");
		printf("			- 회원 관리 시스템 구현 181001 \n");
		printf("			- function display 구현중 181001 \n");
		printf("		*************************************************************************************\n\n");

		MenuButton Button;
		Button.addButton("1. 로그인");
		Button.addButton("2. 회원 가입");
		
		char select[2];
		gets_s(select, 2);
		// 문자열을 정수로 바꾼 후 if문으로 값 판단 후 함수 호출하는 코드 작성
		loginDisplay();
		
		
	}

	void loginDisplay() {
		system("cls");
		
		
		printf("		 __       __                    __            __                        __           \n");
		printf("		/  \\     /  |                  /  |          /  |                      /  |          \n");
		printf("		$$  \\   /$$ | __    __         $$/  _______  $$ |____    ______    ____$$ | __    __ \n");
		printf("		$$$  \\ /$$$ |/  |  /  |        /  |/       \\ $$      \\  /      \\  /    $$ |/  |  /  |\n");
		printf("		$$$$  /$$$$ |$$ |  $$ |        $$ |$$$$$$$  |$$$$$$$  |/$$$$$$  |/$$$$$$$ |$$ |  $$ |\n");
		printf("		$$ $$ $$/$$ |$$ |  $$ |        $$ |$$ |  $$ |$$ |  $$ |$$ |  $$ |$$ |  $$ |$$ |  $$ |\n");
		printf("		$$ |$$$/ $$ |$$ \\__$$ |        $$ |$$ |  $$ |$$ |__$$ |$$ \\__$$ |$$ \\__$$ |$$ \\__$$ |\n");
		printf("		$$ | $/  $$ |$$    $$ | ______ $$ |$$ |  $$ |$$    $$/ $$    $$/ $$    $$ |$$    $$ |\n");
		printf("		$$/      $$/  $$$$$$$ |/      |$$/ $$/   $$/ $$$$$$$/   $$$$$$/   $$$$$$$/  $$$$$$$ |\n");
		printf("		             /  \\__$$ |$$$$$$/                                             /  \\__$$|\n");
		printf("		             $$    $$/                                                     $$    $$/ \n");
		printf("		              $$$$$$/                                                       $$$$$$/  \n\n\n");

		Login user;
		user.loginDisplay();
	
	}


};
